Documents/СписаниеИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеИмущества</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиИмущества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комисия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Имущество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеИмущества/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоставИмуществоПриИзменении(Элемент)
    
    ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
    
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Передача данных: передаем Имущество и Кабинет в общий модуль
    Доступно = ИнвентаризацияСервер.ПроверитьДоступныйОстаток(ТекущиеДанные.Имущество, Объект.Кабинет);
    
    // Обработка данных
    Если Доступно = 0 Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Внимание! Данного имущества нет в выбранном кабинете.";
        Сообщение.Поле = "Объект.Состав[" + Элементы.Состав.ТекущаяСтрока + "].Имущество";
        Сообщение.Сообщить();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоПриИзменении(Элемент)
    
    ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
    
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Подготовка структуры для передачи (Упаковка данных)
    ДанныеОперации = Новый Структура("Имущество, Количество", ТекущиеДанные.Имущество, ТекущиеДанные.Количество);
    
    // Использование блока Попытка-Исключение для обработки ошибок интеграции
    Попытка
        // Вызов функции другого модуля
        Результат = ИнвентаризацияСервер.ВыполнитьДвижениеИмущества(ДанныеОперации);
        
        Если Не Результат.Успех Тогда
            // Если бизнес-логика вернула ложь
            ВызватьИсключение Результат.Сообщение;
        КонецЕсли;
        
    Исключение
        // ИСПРАВЛЕНО: Используем стандартный метод ПоказатьПредупреждение или СообщениеПользователю
        // Ошибка "ОбщегоНазначенияКлиентСервер" исправлена заменой на встроенные средства
        ТекстОшибки = ОписаниеОшибки();
        
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = ТекстОшибки;
        Сообщение.Сообщить();
        
        ТекущиеДанные.Количество = 0; // Сброс некорректных данных
    КонецПопытки;
    
КонецПроцедуры
